garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1778.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="DAC7REF" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="DAC7REF" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-01073_5bit_DAC_wNSS_v2_F177x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x59F">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DAC7CON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACR" edc:desc="" edc:mask="0x1f" edc:name="DACR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="R0" edc:desc="" edc:mask="0x1" edc:name="R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R1" edc:desc="" edc:mask="0x1" edc:name="R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R2" edc:desc="" edc:mask="0x1" edc:name="R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R3" edc:desc="" edc:mask="0x1" edc:name="R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R4" edc:desc="" edc:mask="0x1" edc:name="R4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DAC7R" edc:desc="" edc:mask="0x1f" edc:name="DAC7R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC7R0" edc:desc="" edc:mask="0x1" edc:name="DAC7R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7R1" edc:desc="" edc:mask="0x1" edc:name="DAC7R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7R2" edc:desc="" edc:mask="0x1" edc:name="DAC7R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7R3" edc:desc="" edc:mask="0x1" edc:name="DAC7R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7R4" edc:desc="" edc:mask="0x1" edc:name="DAC7R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:SFRFieldDef edc:cname="REF0" edc:desc="" edc:mask="0x1" edc:name="REF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF1" edc:desc="" edc:mask="0x1" edc:name="REF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF2" edc:desc="" edc:mask="0x1" edc:name="REF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF3" edc:desc="" edc:mask="0x1" edc:name="REF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF4" edc:desc="" edc:mask="0x1" edc:name="REF4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:SFRFieldDef edc:cname="DAC7REF0" edc:desc="" edc:mask="0x1" edc:name="DAC7REF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7REF1" edc:desc="" edc:mask="0x1" edc:name="DAC7REF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7REF2" edc:desc="" edc:mask="0x1" edc:name="DAC7REF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7REF3" edc:desc="" edc:mask="0x1" edc:name="DAC7REF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7REF4" edc:desc="" edc:mask="0x1" edc:name="DAC7REF4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="12" edc:beginaddr="0x600" edc:endaddr="0x620" edc:regionid="sfr12">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x600"/>
        <edc:AdjustPoint edc:offset="8" edc:_addr="0x60C"/>
        <edc:JoinedSFRDef edc:cname="PWM3DC" edc:desc="" edc:name="PWM3DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x614">
          <edc:SFRDef edc:access="nn------" edc:cname="PWM3DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM3DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x614">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x3" edc:name="DC" edc:nzwidth="2"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC0" edc:desc="" edc:mask="0x1" edc:name="DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC1" edc:desc="" edc:mask="0x1" edc:name="DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="PWM3DC0" edc:desc="" edc:mask="0x1" edc:name="PWM3DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC1" edc:desc="" edc:mask="0x1" edc:name="PWM3DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="0x6"/>
                <edc:SFRFieldDef edc:cname="PWMPW0" edc:mask="0x1" edc:name="PWMPW0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW1" edc:mask="0x1" edc:name="PWMPW1" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM3DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x615">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="DC2" edc:desc="" edc:mask="0x1" edc:name="DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC3" edc:desc="" edc:mask="0x1" edc:name="DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC4" edc:desc="" edc:mask="0x1" edc:name="DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC5" edc:desc="" edc:mask="0x1" edc:name="DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC6" edc:desc="" edc:mask="0x1" edc:name="DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC7" edc:desc="" edc:mask="0x1" edc:name="DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC8" edc:desc="" edc:mask="0x1" edc:name="DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC9" edc:desc="" edc:mask="0x1" edc:name="DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3DC2" edc:desc="" edc:mask="0x1" edc:name="PWM3DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC3" edc:desc="" edc:mask="0x1" edc:name="PWM3DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC4" edc:desc="" edc:mask="0x1" edc:name="PWM3DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC5" edc:desc="" edc:mask="0x1" edc:name="PWM3DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC6" edc:desc="" edc:mask="0x1" edc:name="PWM3DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC7" edc:desc="" edc:mask="0x1" edc:name="PWM3DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC8" edc:desc="" edc:mask="0x1" edc:name="PWM3DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC9" edc:desc="" edc:mask="0x1" edc:name="PWM3DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWMPW2" edc:mask="0x1" edc:name="PWMPW2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW3" edc:mask="0x1" edc:name="PWMPW3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW4" edc:mask="0x1" edc:name="PWMPW4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW5" edc:mask="0x1" edc:name="PWMPW5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW6" edc:mask="0x1" edc:name="PWMPW6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW7" edc:mask="0x1" edc:name="PWMPW7" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW8" edc:mask="0x1" edc:name="PWMPW8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW9" edc:mask="0x1" edc:name="PWMPW9" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn----" edc:cname="PWM3CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00----" edc:name="PWM3CON" edc:nzwidth="8" edc:por="0-00----" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x616">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM3POL" edc:desc="" edc:mask="0x1" edc:name="PWM3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3OUT" edc:desc="" edc:mask="0x1" edc:name="PWM3OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM3EN" edc:desc="" edc:mask="0x1" edc:name="PWM3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM4DC" edc:desc="" edc:name="PWM4DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x617">
          <edc:SFRDef edc:access="nn------" edc:cname="PWM4DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM4DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x617">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x3" edc:name="DC" edc:nzwidth="2"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC0" edc:desc="" edc:mask="0x1" edc:name="DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC1" edc:desc="" edc:mask="0x1" edc:name="DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="PWM4DC0" edc:desc="" edc:mask="0x1" edc:name="PWM4DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC1" edc:desc="" edc:mask="0x1" edc:name="PWM4DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="0x6"/>
                <edc:SFRFieldDef edc:cname="PWMPW0" edc:mask="0x1" edc:name="PWMPW0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW1" edc:mask="0x1" edc:name="PWMPW1" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM4DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM4DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x618">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="DC2" edc:desc="" edc:mask="0x1" edc:name="DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC3" edc:desc="" edc:mask="0x1" edc:name="DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC4" edc:desc="" edc:mask="0x1" edc:name="DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC5" edc:desc="" edc:mask="0x1" edc:name="DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC6" edc:desc="" edc:mask="0x1" edc:name="DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC7" edc:desc="" edc:mask="0x1" edc:name="DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC8" edc:desc="" edc:mask="0x1" edc:name="DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC9" edc:desc="" edc:mask="0x1" edc:name="DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM4DC2" edc:desc="" edc:mask="0x1" edc:name="PWM4DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC3" edc:desc="" edc:mask="0x1" edc:name="PWM4DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC4" edc:desc="" edc:mask="0x1" edc:name="PWM4DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC5" edc:desc="" edc:mask="0x1" edc:name="PWM4DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC6" edc:desc="" edc:mask="0x1" edc:name="PWM4DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC7" edc:desc="" edc:mask="0x1" edc:name="PWM4DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC8" edc:desc="" edc:mask="0x1" edc:name="PWM4DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC9" edc:desc="" edc:mask="0x1" edc:name="PWM4DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWMPW2" edc:mask="0x1" edc:name="PWMPW2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW3" edc:mask="0x1" edc:name="PWMPW3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW4" edc:mask="0x1" edc:name="PWMPW4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW5" edc:mask="0x1" edc:name="PWMPW5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW6" edc:mask="0x1" edc:name="PWMPW6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW7" edc:mask="0x1" edc:name="PWMPW7" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW8" edc:mask="0x1" edc:name="PWMPW8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW9" edc:mask="0x1" edc:name="PWMPW9" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn----" edc:cname="PWM4CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00----" edc:name="PWM4CON" edc:nzwidth="8" edc:por="0-00----" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x619">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM4POL" edc:desc="" edc:mask="0x1" edc:name="PWM4POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4OUT" edc:desc="" edc:mask="0x1" edc:name="PWM4OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM4EN" edc:desc="" edc:mask="0x1" edc:name="PWM4EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM9DC" edc:desc="" edc:name="PWM9DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61A">
          <edc:SFRDef edc:access="nn------" edc:cname="PWM9DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM9DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x3" edc:name="DC" edc:nzwidth="2"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC0" edc:desc="" edc:mask="0x1" edc:name="DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC1" edc:desc="" edc:mask="0x1" edc:name="DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="PWM9DC0" edc:desc="" edc:mask="0x1" edc:name="PWM9DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC1" edc:desc="" edc:mask="0x1" edc:name="PWM9DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="0x6"/>
                <edc:SFRFieldDef edc:cname="PWMPW0" edc:mask="0x1" edc:name="PWMPW0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW1" edc:mask="0x1" edc:name="PWMPW1" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM9DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM9DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="DC2" edc:desc="" edc:mask="0x1" edc:name="DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC3" edc:desc="" edc:mask="0x1" edc:name="DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC4" edc:desc="" edc:mask="0x1" edc:name="DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC5" edc:desc="" edc:mask="0x1" edc:name="DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC6" edc:desc="" edc:mask="0x1" edc:name="DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC7" edc:desc="" edc:mask="0x1" edc:name="DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC8" edc:desc="" edc:mask="0x1" edc:name="DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC9" edc:desc="" edc:mask="0x1" edc:name="DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM9DC2" edc:desc="" edc:mask="0x1" edc:name="PWM9DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC3" edc:desc="" edc:mask="0x1" edc:name="PWM9DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC4" edc:desc="" edc:mask="0x1" edc:name="PWM9DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC5" edc:desc="" edc:mask="0x1" edc:name="PWM9DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC6" edc:desc="" edc:mask="0x1" edc:name="PWM9DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC7" edc:desc="" edc:mask="0x1" edc:name="PWM9DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC8" edc:desc="" edc:mask="0x1" edc:name="PWM9DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC9" edc:desc="" edc:mask="0x1" edc:name="PWM9DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWMPW2" edc:mask="0x1" edc:name="PWMPW2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW3" edc:mask="0x1" edc:name="PWMPW3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW4" edc:mask="0x1" edc:name="PWMPW4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW5" edc:mask="0x1" edc:name="PWMPW5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW6" edc:mask="0x1" edc:name="PWMPW6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW7" edc:mask="0x1" edc:name="PWMPW7" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW8" edc:mask="0x1" edc:name="PWMPW8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW9" edc:mask="0x1" edc:name="PWMPW9" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
