garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1778.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RSIM0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RSIM0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x697">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSIM0" edc:desc="" edc:mask="0x1" edc:name="RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM1" edc:desc="" edc:mask="0x1" edc:name="RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM2" edc:desc="" edc:mask="0x1" edc:name="RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM3" edc:desc="" edc:mask="0x1" edc:name="RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM4" edc:desc="" edc:mask="0x1" edc:name="RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM5" edc:desc="" edc:mask="0x1" edc:name="RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM6" edc:desc="" edc:mask="0x1" edc:name="RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM7" edc:desc="" edc:mask="0x1" edc:name="RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RSIM0" edc:desc="" edc:mask="0x1" edc:name="G1RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM1" edc:desc="" edc:mask="0x1" edc:name="G1RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM2" edc:desc="" edc:mask="0x1" edc:name="G1RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM3" edc:desc="" edc:mask="0x1" edc:name="G1RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM4" edc:desc="" edc:mask="0x1" edc:name="G1RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM5" edc:desc="" edc:mask="0x1" edc:name="G1RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM6" edc:desc="" edc:mask="0x1" edc:name="G1RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM7" edc:desc="" edc:mask="0x1" edc:name="G1RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RSIM1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RSIM1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x698">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSIM8" edc:desc="" edc:mask="0x1" edc:name="RSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM9" edc:desc="" edc:mask="0x1" edc:name="RSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM10" edc:desc="" edc:mask="0x1" edc:name="RSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM11" edc:desc="" edc:mask="0x1" edc:name="RSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM12" edc:desc="" edc:mask="0x1" edc:name="RSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM13" edc:desc="" edc:mask="0x1" edc:name="RSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM14" edc:desc="" edc:mask="0x1" edc:name="RSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM15" edc:desc="" edc:mask="0x1" edc:name="RSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RSIM8" edc:desc="" edc:mask="0x1" edc:name="G1RSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM9" edc:desc="" edc:mask="0x1" edc:name="G1RSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM10" edc:desc="" edc:mask="0x1" edc:name="G1RSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM11" edc:desc="" edc:mask="0x1" edc:name="G1RSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM12" edc:desc="" edc:mask="0x1" edc:name="G1RSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM13" edc:desc="" edc:mask="0x1" edc:name="G1RSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM14" edc:desc="" edc:mask="0x1" edc:name="G1RSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM15" edc:desc="" edc:mask="0x1" edc:name="G1RSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1FIS0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1FIS0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x699">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIS0" edc:desc="" edc:mask="0x1" edc:name="FIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS1" edc:desc="" edc:mask="0x1" edc:name="FIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS2" edc:desc="" edc:mask="0x1" edc:name="FIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS3" edc:desc="" edc:mask="0x1" edc:name="FIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS4" edc:desc="" edc:mask="0x1" edc:name="FIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS5" edc:desc="" edc:mask="0x1" edc:name="FIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS6" edc:desc="" edc:mask="0x1" edc:name="FIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS7" edc:desc="" edc:mask="0x1" edc:name="FIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1FIS0" edc:desc="" edc:mask="0x1" edc:name="G1FIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS1" edc:desc="" edc:mask="0x1" edc:name="G1FIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS2" edc:desc="" edc:mask="0x1" edc:name="G1FIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS3" edc:desc="" edc:mask="0x1" edc:name="G1FIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS4" edc:desc="" edc:mask="0x1" edc:name="G1FIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS5" edc:desc="" edc:mask="0x1" edc:name="G1FIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS6" edc:desc="" edc:mask="0x1" edc:name="G1FIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS7" edc:desc="" edc:mask="0x1" edc:name="G1FIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1FIS1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1FIS1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x69A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIS8" edc:desc="" edc:mask="0x1" edc:name="FIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS9" edc:desc="" edc:mask="0x1" edc:name="FIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS10" edc:desc="" edc:mask="0x1" edc:name="FIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS11" edc:desc="" edc:mask="0x1" edc:name="FIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS12" edc:desc="" edc:mask="0x1" edc:name="FIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS13" edc:desc="" edc:mask="0x1" edc:name="FIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS14" edc:desc="" edc:mask="0x1" edc:name="FIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS15" edc:desc="" edc:mask="0x1" edc:name="FIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1FIS8" edc:desc="" edc:mask="0x1" edc:name="G1FIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS9" edc:desc="" edc:mask="0x1" edc:name="G1FIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS10" edc:desc="" edc:mask="0x1" edc:name="G1FIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS11" edc:desc="" edc:mask="0x1" edc:name="G1FIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS12" edc:desc="" edc:mask="0x1" edc:name="G1FIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS13" edc:desc="" edc:mask="0x1" edc:name="G1FIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS14" edc:desc="" edc:mask="0x1" edc:name="G1FIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS15" edc:desc="" edc:mask="0x1" edc:name="G1FIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1FSIM0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1FSIM0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x69B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSIM0" edc:desc="" edc:mask="0x1" edc:name="FSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM1" edc:desc="" edc:mask="0x1" edc:name="FSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM2" edc:desc="" edc:mask="0x1" edc:name="FSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM3" edc:desc="" edc:mask="0x1" edc:name="FSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM4" edc:desc="" edc:mask="0x1" edc:name="FSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM5" edc:desc="" edc:mask="0x1" edc:name="FSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM6" edc:desc="" edc:mask="0x1" edc:name="FSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM7" edc:desc="" edc:mask="0x1" edc:name="FSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1FSIM0" edc:desc="" edc:mask="0x1" edc:name="G1FSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM1" edc:desc="" edc:mask="0x1" edc:name="G1FSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM2" edc:desc="" edc:mask="0x1" edc:name="G1FSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM3" edc:desc="" edc:mask="0x1" edc:name="G1FSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM4" edc:desc="" edc:mask="0x1" edc:name="G1FSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM5" edc:desc="" edc:mask="0x1" edc:name="G1FSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM6" edc:desc="" edc:mask="0x1" edc:name="G1FSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM7" edc:desc="" edc:mask="0x1" edc:name="G1FSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
