garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1778.PIC
        <edc:JoinedSFRDef edc:cname="PWM5TMR" edc:desc="" edc:name="PWM5TMR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD99">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM5TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD99">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5TMRL0" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL1" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL2" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL3" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL4" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL5" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL6" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL7" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5TMRL" edc:desc="" edc:mask="0xff" edc:name="PWM5TMRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM5TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD9A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5TMRH0" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH1" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH2" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH3" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH4" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH5" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH6" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH7" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5TMRH" edc:desc="" edc:mask="0xff" edc:name="PWM5TMRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rnnn--" edc:cname="PWM5CON" edc:desc="" edc:impl="0xbc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000--" edc:name="PWM5CON" edc:nzwidth="8" edc:por="0-0000--" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD9B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM5MODE0" edc:desc="" edc:mask="0x1" edc:name="PWM5MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5MODE1" edc:desc="" edc:mask="0x1" edc:name="PWM5MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM5MODE" edc:desc="" edc:mask="0x3" edc:name="PWM5MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PWM5POL" edc:desc="" edc:mask="0x1" edc:name="PWM5POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5OUT" edc:desc="" edc:mask="0x1" edc:name="PWM5OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM5EN" edc:desc="" edc:mask="0x1" edc:name="PWM5EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
